# Taps (custom)
tap "jnsahaj/lumen"
tap "mobile-dev-inc/tap"
tap "tw93/tap"

# CLI tools
brew "bat"
brew "bitwarden-cli"
brew "coreutils"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "gping"
brew "grep"
brew "httpie"
brew "mas"
brew "node"
brew "python@3.10"
brew "watchman"

# Mobile dev
brew "cocoapods"
brew "fastlane"
brew "mobile-dev-inc/tap/maestro"

# Custom taps
brew "jnsahaj/lumen/lumen"
brew "tw93/tap/mole"
brew "snitch"

# Casks — aplikacje
cask "arc"
cask "autodesk-fusion"
cask "bambu-studio"
cask "brave-browser"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "httpie-desktop"
cask "imageoptim"
cask "orbstack"
cask "pastebot"
cask "qlmarkdown"
cask "quicklook-json"
cask "raindropio"
cask "raycast"
cask "reflex-app"
cask "stats"
cask "tailscale-app"
cask "the-unarchiver"
cask "tinkerwell"
cask "transmit"
cask "tunnelbear"
cask "tuple"
cask "visual-studio-code"
cask "yaak"
cask "zed"
cask "zen"
cask "zulu@17"

# Mac App Store
mas "Xcode", id: 497799835
