tap "tw93/tap"

brew "bat"
brew "chezmoi"
brew "coreutils"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "mas"
brew "snitch"
brew "watchman"
brew "tw93/tap/mole"

cask "arc"
cask "bambu-studio"
cask "bitwarden"
cask "font-monaspace"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "ghostty"
cask "github"
cask "orbstack"
cask "raycast"
cask "stats"
cask "tailscale-app"
cask "the-unarchiver"
cask "visual-studio-code"
cask "yaak"
cask "zed"
cask "zen"
cask "zulu@17"

mas "Xcode", id: 497799835
