anthropic.claude-code
biomejs.biome
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
coderabbit.coderabbit-vscode
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
jhasse.bracket-select2
mechatroner.rainbow-csv
meganrogge.template-string-converter
ms-vscode.vscode-speech
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
upstash.context7-mcp
vitest.explorer
wmaurer.change-case
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
